/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/

#pragma once
#include "main.h"

/*
*********************************************************************************************************
*                                               CONSTANTS
*********************************************************************************************************
*/

#define ACTION_BUFFER_SIZE 56
#define ACTION_FRAME_SIZE 28
#define ACTION_FRAME_HEADER_ONE 0x0D
#define ACTION_FRAME_HEADER_TWO 0x0A
#define ACTION_FRAME_FOOTER_ONE 0x0A
#define ACTION_FRAME_FOOTER_TWO 0x0D
#ifndef PI
#define PI    3.14159265358979f
#endif


/*
*********************************************************************************************************
*                                             EXPORTED_TYPES
*********************************************************************************************************
*/



/*
*********************************************************************************************************
*                                          变量实现
*********************************************************************************************************
*/

extern uint8_t ACTION_RX_BUF[ACTION_BUFFER_SIZE];
extern uint8_t Action_Flag;
extern uint8_t Action_ch ; // 接受值
/// @brief Action接收标志
extern  uint8_t Action_flag ; // 接收标志
/// @brief Action接收状态机
extern  uint8_t Action_step ; // 状态机
/// @brief Action接收计数
extern  uint8_t Action_count ; // 计数
extern uint8_t sh[100];
/*
*********************************************************************************************************
*                                           FUNCTION PROTOTYPES
*********************************************************************************************************
*/
void ACTION_Analyze(void);
void Action_Clear(void);
void Action_Signal_Send(void);
